wosayttn/sdk-bsp-numaker-m55m1/libraries/m55m1/rtt_port/drv_uart.c
/**************************************************************************//**
*
* @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
*
* SPDX-License-Identifier: Apache-2.0
*
* Change Logs:
* Date            Author       Notes
* 2024-1-25       Wayne        First version
*
******************************************************************************/

#include <rtconfig.h>

#if defined(BSP_USING_UART)

#include <rtdevice.h>
#include <rthw.h>
#include "NuMicro.h"
#include <drv_uart.h>

#if defined(RT_SERIAL_USING_DMA)
    #include <drv_pdma.h>
#endif

#define LOG_TAG    "drv.uart"
#undef  DBG_ENABLE
#define DBG_SECTION_NAME   LOG_TAG
#define DBG_LEVEL      LOG_LVL_WARNING
#define DBG_COLOR
#include <rtdbg.h>

/* Private define ---------------------------------------------------------------*/
#define CONFIG_UART_USE_IDLE_TIMER

#if defined(CONFIG_UART_USE_IDLE_TIMER)
    #define CONFIG_PDMA_USE_IT               (NU_PDMA_EVENT_TRANSFER_DONE)
    #define CONFIG_UART_USE_RXDMA_IT         (UART_INTEN_RLSIEN_Msk | UART_INTEN_RXPDMAEN_Msk | UART_INTEN_RXTOIEN_Msk | UART_INTEN_TOCNTEN_Msk)
    #define CONFIG_UART_IDLE_TIMEOUT_VALUE   (50)
    #define CONFIG_PDMA_IDLE_TIMEOUT_VALUE   (0)
#else
    #define CONFIG_PDMA_USE_IT               (NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_TIMEOUT)
    #define CONFIG_UART_USE_RXDMA_IT         (UART_INTEN_RLSIEN_Msk | UART_INTEN_RXPDMAEN_Msk)
    #define CONFIG_PDMA_IDLE_TIMEOUT_VALUE   (1000000 * 10 * (1 + psNuUart->dev.config.data_bits + (psNuUart->dev.config.stop_bits + 1)) / psNuUart->dev.config.baud_rate)
#endif

#define CONFIG_UART_USE_TXDMA_IT             (UART_INTEN_TXPDMAEN_Msk)

enum
{
    UART_START = -1,
#if defined(BSP_USING_UART0)
    UART0_IDX,
#endif
#if defined(BSP_USING_UART1)
    UART1_IDX,
#endif
#if defined(BSP_USING_UART2)
    UART2_IDX,
#endif
#if defined(BSP_USING_UART3)
    UART3_IDX,
#endif
#if defined(BSP_USING_UART4)
    UART4_IDX,
#endif
#if defined(BSP_USING_UART5)
    UART5_IDX,
#endif
#if defined(BSP_USING_UART6)
    UART6_IDX,
#endif
#if defined(BSP_USING_UART7)
    UART7_IDX,
#endif
#if defined(BSP_USING_UART8)
    UART8_IDX,
#endif
#if defined(BSP_USING_UART9)
    UART9_IDX,
#endif
    UART_CNT
};

struct nu_rxbuf_ctx
{
    uint8_t *pu8RxBuf;
    uint32_t bufsize;
    uint32_t put_index;
    uint32_t reserved;
};
typedef struct nu_rxbuf_ctx *nu_rxbuf_ctx_t;

/* Private typedef --------------------------------------------------------------*/
struct nu_uart
{
    rt_serial_t dev;
    char *name;
    UART_T *base;
    uint32_t rst;
    IRQn_Type irqn;

#if defined(RT_SERIAL_USING_DMA)
    uint32_t dma_flag;
    uint32_t pdma_perp_tx;
    uint32_t pdma_chanid_tx;

    uint32_t pdma_perp_rx;
    uint32_t pdma_chanid_rx;

    nu_pdma_desc_t pdma_rx_desc;
    struct nu_rxbuf_ctx dmabuf;
#endif

};
typedef struct nu_uart *nu_uart_t;

/* Private functions ------------------------------------------------------------*/
static rt_err_t nu_uart_configure(struct rt_serial_device *serial, struct serial_configure *cfg);
static rt_err_t nu_uart_control(struct rt_serial_device *serial, int cmd, void *arg);
static int nu_uart_send(struct rt_serial_device *serial, char c);
static int nu_uart_receive(struct rt_serial_device *serial);
static void nu_uart_isr(nu_uart_t serial);

#if defined(RT_SERIAL_USING_DMA)
    static rt_size_t nu_uart_dma_transmit(struct rt_serial_device *serial, rt_uint8_t *buf, rt_size_t size, int direction);
    static void nu_pdma_uart_rx_cb(void *pvOwner, uint32_t u32Events);
    static void nu_pdma_uart_tx_cb(void *pvOwner, uint32_t u32Events);
#endif

/* Public functions ------------------------------------------------------------*/

/* Private variables ------------------------------------------------------------*/

static const struct rt_uart_ops nu_uart_ops =
{
    .configure = nu_uart_configure,
    .control = nu_uart_control,
    .putc = nu_uart_send,
    .getc = nu_uart_receive,
#if defined(RT_SERIAL_USING_DMA)
    .dma_transmit = nu_uart_dma_transmit
#else
    .dma_transmit = RT_NULL
#endif
};

static const struct serial_configure nu_uart_default_config =
        RT_SERIAL_CONFIG_DEFAULT;

#define MAKE_UART_NAME(x)         #x
#define MAKE_PDMA_UART_TX(x)      PDMA_UART##x##_TX
#define MAKE_PDMA_UART_RX(x)      PDMA_UART##x##_RX

#if defined(RT_SERIAL_USING_DMA)
#define MAKE_UART_INSTANCE(x, t, r) \
    { \
        .name = MAKE_UART_NAME(uart##x), \
        .base = UART##x, \
        .rst  = SYS_UART##x##RST, \
        .irqn = UART##x##_IRQn, \
        .pdma_perp_tx = t, \
        .pdma_perp_rx = r, \
    },
#else
#define MAKE_UART_INSTANCE(x, t, r) \
    { \
        .name = MAKE_UART_NAME(uart##x), \
        .base = UART##x, \
        .rst  = SYS_UART##x##RST, \
        .irqn = UART##x##_IRQn, \
    },
#endif

static struct nu_uart nu_uart_arr [] =
{
#if defined(BSP_USING_UART0)
    MAKE_UART_INSTANCE(0,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART0_TX_DMA)
                       MAKE_PDMA_UART_TX(0),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART0_RX_DMA)
                       MAKE_PDMA_UART_RX(0)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART1)
    MAKE_UART_INSTANCE(1,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART1_TX_DMA)
                       MAKE_PDMA_UART_TX(1),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART1_RX_DMA)
                       MAKE_PDMA_UART_RX(1)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART2)
    MAKE_UART_INSTANCE(2,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART2_TX_DMA)
                       MAKE_PDMA_UART_TX(2),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART2_RX_DMA)
                       MAKE_PDMA_UART_RX(2)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART3)
    MAKE_UART_INSTANCE(3,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART3_TX_DMA)
                       MAKE_PDMA_UART_TX(3),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART3_RX_DMA)
                       MAKE_PDMA_UART_RX(3)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART4)
    MAKE_UART_INSTANCE(4,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART4_TX_DMA)
                       MAKE_PDMA_UART_TX(4),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART4_RX_DMA)
                       MAKE_PDMA_UART_RX(4)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

