wosayttn/sdk-bsp-numaker-m55m1/libraries/m55m1/rtt_port/drv_uart.c
#if defined(BSP_USING_UART5)
    MAKE_UART_INSTANCE(5,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART5_TX_DMA)
                       MAKE_PDMA_UART_TX(5),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART5_RX_DMA)
                       MAKE_PDMA_UART_RX(5)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART6)
    MAKE_UART_INSTANCE(6,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART6_TX_DMA)
                       MAKE_PDMA_UART_TX(6),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART6_RX_DMA)
                       MAKE_PDMA_UART_RX(6)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART7)
    MAKE_UART_INSTANCE(7,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART7_TX_DMA)
                       MAKE_PDMA_UART_TX(7),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART7_RX_DMA)
                       MAKE_PDMA_UART_RX(7)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART8)
    MAKE_UART_INSTANCE(8,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART8_TX_DMA)
                       MAKE_PDMA_UART_TX(8),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART8_RX_DMA)
                       MAKE_PDMA_UART_RX(8)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

#if defined(BSP_USING_UART9)
    MAKE_UART_INSTANCE(9,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART9_TX_DMA)
                       MAKE_PDMA_UART_TX(9),
#else
                       NU_PDMA_UNUSED,
#endif
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_UART9_RX_DMA)
                       MAKE_PDMA_UART_RX(9)
#else
                       NU_PDMA_UNUSED
#endif
                      )
#endif

}; /* uart nu_uart */

/* Interrupt Handle Function  ----------------------------------------------------*/
#define MAKE_UART_ISR(x) \
    void UART##x##_IRQHandler(void) \
    { \
       rt_interrupt_enter(); \
       nu_uart_isr(&nu_uart_arr[UART##x##_IDX]); \
       rt_interrupt_leave(); \
    }

#if defined(BSP_USING_UART0)
    MAKE_UART_ISR(0);
#endif

#if defined(BSP_USING_UART1)
    MAKE_UART_ISR(1);
#endif

#if defined(BSP_USING_UART2)
    MAKE_UART_ISR(2);
#endif

#if defined(BSP_USING_UART3)
    MAKE_UART_ISR(3);
#endif

#if defined(BSP_USING_UART4)
    MAKE_UART_ISR(4);
#endif

#if defined(BSP_USING_UART5)
    MAKE_UART_ISR(5);
#endif

#if defined(BSP_USING_UART6)
    MAKE_UART_ISR(6);
#endif

#if defined(BSP_USING_UART7)
    MAKE_UART_ISR(7);
#endif

#if defined(BSP_USING_UART8)
    MAKE_UART_ISR(8);
#endif

#if defined(BSP_USING_UART9)
    MAKE_UART_ISR(9);
#endif

/**
 * All UART interrupt service routine
 */
static void nu_uart_isr(nu_uart_t psNuUart)
{
    /* Get base address of uart register */
    UART_T *base = psNuUart->base;

    /* Get interrupt event */
    uint32_t u32IntSts = base->INTSTS;
    uint32_t u32FIFOSts = base->FIFOSTS;

#if defined(RT_SERIAL_USING_DMA)
    if (u32IntSts & UART_INTSTS_HWRLSIF_Msk)
    {
        /* Drain RX FIFO to remove remain FEF frames in FIFO. */
        base->FIFO |= UART_FIFO_RXRST_Msk;
        base->FIFOSTS |= (UART_FIFOSTS_BIF_Msk | UART_FIFOSTS_FEF_Msk | UART_FIFOSTS_PEF_Msk);
        return;
    }

#if defined(CONFIG_UART_USE_IDLE_TIMER)
    if (u32IntSts & UART_INTSTS_HWTOIF_Msk)
    {
        /* In UART RX PDMA mode, bus idle timeout occurred. */
        nu_pdma_uart_rx_cb((void *)psNuUart, NU_PDMA_EVENT_TIMEOUT);

        /* clear int flag */
        base->INTSTS = u32IntSts;
        return;
    }
#endif

#endif

    /* Handle RX event */
    if (u32IntSts & (UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk))
    {
        rt_hw_serial_isr(&psNuUart->dev, RT_SERIAL_EVENT_RX_IND);
    }

    base->INTSTS = u32IntSts;
    base->FIFOSTS = u32FIFOSts;
}

/**
 * Set RS-485 AUD mode
 */
void nu_uart_set_rs485aud(struct rt_serial_device *serial, rt_bool_t bRTSActiveLowLevel)
{
    nu_uart_t psNuUart = (nu_uart_t)serial;
    UART_T *base;
    RT_ASSERT(serial);

    /* Get base address of uart register */
    base = ((nu_uart_t)serial)->base;

    /* Set RTS as RS-485 phy direction controlling ping. */
    UART_SelectRS485Mode(base, UART_ALTCTL_RS485AUD_Msk, 0);

    if (bRTSActiveLowLevel)
    {
        /* Set direction pin as active-low. */
        base->MODEM |= UART_MODEM_RTSACTLV_Msk;
    }
    else
    {
        /* Set direction pin as active-high. */
        base->MODEM &= ~UART_MODEM_RTSACTLV_Msk;
    }

    LOG_I("Set %s to RS-485 AUD function mode. ActiveLowLevel-%s", psNuUart->name, bRTSActiveLowLevel ? "YES" : "NO");
}

/**
 * Configure uart port
 */
static rt_err_t nu_uart_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    nu_uart_t psNuUart = (nu_uart_t)serial;
    rt_err_t ret = RT_EOK;
    uint32_t uart_word_len, uart_stop_bit, uart_parity;

    RT_ASSERT(serial);
    RT_ASSERT(cfg);

    /* Check baudrate */
    RT_ASSERT(cfg->baud_rate != 0);

    uart_word_len = uart_stop_bit = uart_parity = 0;

    /* Get base address of uart register */
    UART_T *base = psNuUart->base;

    /* Check word len */
    switch (cfg->data_bits)
    {
    case DATA_BITS_5:
        uart_word_len = UART_WORD_LEN_5;
        break;

    case DATA_BITS_6:
        uart_word_len = UART_WORD_LEN_6;
        break;

    case DATA_BITS_7:
        uart_word_len = UART_WORD_LEN_7;
        break;

    case DATA_BITS_8:
        uart_word_len = UART_WORD_LEN_8;
        break;

    default:
        LOG_E("Unsupported data length.");
        ret = RT_EINVAL;
        goto exit_nu_uart_configure;
    }

    /* Check stop bit */
    switch (cfg->stop_bits)
    {
    case STOP_BITS_1:
        uart_stop_bit = UART_STOP_BIT_1;
        break;

    case STOP_BITS_2:
        uart_stop_bit = UART_STOP_BIT_2;
        break;

    default:
        LOG_E("Unsupported stop bit.");
        ret = RT_EINVAL;
        goto exit_nu_uart_configure;
    }

    /* Check parity */
    switch (cfg->parity)
    {
    case PARITY_NONE:
        uart_parity = UART_PARITY_NONE;
        break;

    case PARITY_ODD:
        uart_parity = UART_PARITY_ODD;
        break;

